Revit 2024 API
CurveElementFilter.CurveElementType Property
 The curve element type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public CurveElementType CurveElementType { get; }
Visual Basic
Public ReadOnly Property CurveElementType As CurveElementType
	Get
Visual C++
public:
property CurveElementType CurveElementType {
	CurveElementType get ();
}
See Also
CurveElementFilter Class
Autodesk.Revit.DB Namespace